app/Http/Controllers/Auth/LoginController.php

select * from `vendor_details` where `user_id` = '12' limit 1
---
    protected function authenticated(Request $request, $user)
    {
        if($user->user_type_id == '3') {
            return redirect()->intended('/admin/dashboard');
        }
        if ($user->user_type_id == '2')
        {
            $detail = VendorDetail::where('user_id', $user->id)->get();