app/Http/Controllers/Auth/RegisterController.php

    protected function create(array $data)
    {
        $lastUser = User::orderBy( 'id', 'DESC' )->first();

        $code = ( $lastUser ) ? $this->generate_user_code( $lastUser->code ) : 'u-0001';

        return User::create([
            'name'          => $data['name'],
            'email'         => $data['email'],
            'password'      => bcrypt($data['password']),
            'user_type_id'  => $data['user_type_id'],
            'code'          => $code,
            'status'        => 0,
            'email_token'   => base64_encode( time() . $data['email'] )
        ]);
---
select * from `users` order by `id` desc limit 1
insert into `users` (`name`, `email`, `password`, `user_type_id`, `code`, `status`, `email_token`, `updated_at`, `created_at`) values ('Sawood Ahmed', 'sawood.ahmed@ascentisglobal.com', 'y$qspJcLdKVgrmfXkT0EgcuOdDbVovRyhFS8DRpMpgOguu9LzmP1miC', '2', 'u-0013', '1', 'MTUyNDAzNTA1MHNhd29vZC5haG1lZEBhc2NlbnRpc2dsb2JhbC5jb20=', '2018-04-18 12:04:10', '2018-04-18 12:04:10')

    public function verify($token)
    {
        $user = User::where( 'email_token', $token )->first();
        $user->verified = 1;
        if( $user->save() )
---
select * from `users` where `email_token` = 'MTUyNDAzNTA1MHNhd29vZC5haG1lZEBhc2NlbnRpc2dsb2JhbC5jb20=' limit 1
update `users` set `verified` = '1', `updated_at` = '2018-04-18 12:05:38' where `id` = '13'