routes/web.php

select * from `countries` where `countries`.`id` = '166' limit 1
select * from `states` where `states`.`id` = '2729' limit 1
select * from `cities` where `cities`.`state_id` = '2729' and `cities`.`state_id` is not null
select * from `sub_categories` where `category_id` = '4'
---
Route::get( '/', 					'HomeController@index' )->name( 'home' );
Route::get( 'verifyemail/{token}',	'Auth\RegisterController@verify' );

Route::post( 'get_country_state', function( Request $request ) {
	return \App\Country::find( $request->country_id )->state;
});

Route::post( 'get_state_city', function( Request $request ) {
	return \App\State::find( $request->state_id )->city;
});

Route::post( 'get_sub_category', function( Request $request ) {
	return \App\SubCategory::where( 'category_id', $request->category_id )->get();
});