app/Http/Controllers/BuyerRequirementController.php

select * from `buyer_requirements` where `status_id` = '2'
select * from `sub_categories` where `sub_categories`.`id` in ('51')
---
    public function index()
    {
    	$this->data['requirement'] = BuyerRequirement::where( 'status_id', '2' )->with( 'sub_category', 'category', 'user' )->get();

select * from `sub_categories` where `sub_categories`.`id` in ('51')
select * from `users` where `users`.`id` in ('10')
select * from `buyer_requirements` where (`category_id` = '3' and `status_id` = '2' and `id` = '!= 2')
---
    public function show( $code )
    {
    	$requirement                       = BuyerRequirement::where( [ 'code' => $code, 'status_id' => '2' ] )->with( 'sub_category', 'category', 'user' )->first();

select * from `sub_categories` where `slug` = 'ms-amiya-schamberger-i' limit 1
---
    public function get_by_category($category_slug)
    {
    	$category    = Category::where( 'slug', $category_slug )->first();