app/Http/Controllers/ComparisonController.php

    public function store( Request $request )
    {
        $count = session( 'productCount' );
        // return $count;
        if( session()->exists( 'comparisonList' ) )
        {
            $list   = session( 'comparisonList' );
            $count  = count( $list );

            if( ! array_key_exists( $request->product_id, $list ) )
            {
                $list[ $request->product_id ] = Product::with( 'user', 'currency', 'country', 'unit', 'sub_category', 'category' )->where( 'id', $request->product_id )->first();

                $count = count( $list );

                session( [ 'comparisonList' => $list, 'productCount' => $count ] );
            }
        }
        else
        {
            $list[ $request->product_id ] = Product::with( 'user', 'currency', 'country', 'unit', 'sub_category', 'category' )->where( 'id', $request->product_id )->first();
---
select * from `products` where `id` = '1'