app/Http/Controllers/ProductController.php

    public function index()
    {
        $categories = Category::get();
        $products   = Product::with( 'sub_category.category', 'user.detail', 'currency' )->paginate( 12 );
---
select * from `categories`
select * from `currencies` where `currencies`.`id` in ('1', '4')
select * from `products` limit 12 offset 0
select * from `sub_categories` where `sub_categories`.`id` in ('10', '17', '85')
select * from `users` where `users`.`id` in ('3', '4', '12')