app/Http/Controllers/ProfileController.php

select `name`, `id` from `countries`
---
    public function create()
    {
    	$country   = Country::pluck( 'name', 'id' );

select `name`, `id` from `countries`
select * from `users` where `code` = 'u-0012' limit 1
---
    public function edit( $code )
    {
        $userCode = Auth::user()->code;
        if( $code !== $userCode )
        {
            return redirect( route( 'profile.edit', [ $userCode ] ) );
        }

        $country    = Country::pluck( 'name', 'id' );
        $user       = User::with( 'detail' )->where( 'code', $code )->first();

select * from `users` where `code` = 'u-0013' limit 1
---
    public function show( $code )
    {
        $this->data['user']         = User::with( 'detail' )->where( 'code', $code )->first();