app/Http/Controllers/ReviewsController.php

    public function index( $vendor_code )
    {
        $this->data['vendor']   = \App\User::where( [ 'code' => $vendor_code ] )->first();
        // return $this->data['vendor'];
        $this->data['reviews']  = \App\Review::where( [ 'status_id' => 2, 'vendor_code' => $vendor_code ] )->with( 'user.detail' )->paginate( 10 );
---
select * from `users` where (`code` = 'u-0012') limit 1
select * from `reviews` where (`status_id` = '2' and `vendor_code` = 'u-0012') limit 10 offset 0
select * from `users` where `users`.`id` in ('12')
select count(*) as aggregate from `reviews` where (`status_id` = '2' and `vendor_code` = 'u-0012')