app/Http/Controllers/Backend/ProductController.php

    public function index()
    {
        $products   = Product::with( 'sub_category', 'category', 'user.detail', 'currency', 'status' )->get();
---
select * from `currencies` where `currencies`.`id` in ('13')
select * from `products`
select * from `statuses` where `statuses`.`id` in ('2', '3')
select * from `sub_categories` where `sub_categories`.`id` in ('1', '38')