app/Http/Controllers/Backend/RequirementController.php

    public function index()
    {
        $requirements = BuyerRequirement::with('status', 'unit')->get();
---
select * from `buyer_requirements`
select * from `statuses` where `statuses`.`id` in ('2')
select * from `units` where `units`.`id` in ('63')

    public function show($id)
    {
        $requirement = BuyerRequirement::find($id);
        $units = Unit::pluck('name', 'id');
        $category = Category::pluck('name', 'id');
---
select * from `buyer_requirements` where `buyer_requirements`.`id` = '1' limit 1
select `name`, `id` from `units`
select `name`, `id` from `categories`

            'sub_category_id' => $request->sub_category_id,
            'status_id' => $status
        ];
        BuyerRequirement::where('id', $id)->update($options);
---
update `buyer_requirements` set `name` = 'iphone 6s plus', `slug` = 'iphone-6s-plus', `unit_id` = '63', `quantity` = '10', `description` = '64 gb memory \r\nsasta wala', `category_id` = '3', `sub_category_id` = '76', `status_id` = '2', `updated_at` = '2018-04-18 13:45:13' where `id` = '1'