app/Http/Controllers/Backend/UserController.php

    public function index($user_type)
    {
        $user_type = UserType::where('name', $user_type)->first();

        // $user = User::where('user_type_id', $user_type->id)
        //        ->orderBy('id', 'desc')
        //        ->get();
        $user = $user_type->user;
        return view( 'backend.users.index' )->with( 'users', $user )->with( 'user_type', $user_type );
---
select * from `user_types` where `name` = 'vendor' limit 1
select * from `users` where `users`.`user_type_id` = '2' and `users`.`user_type_id` is not null